tutorials/surfaceTracking/newInterFreeFoam/capillarity2DoneFluid/0/contactAngle
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  | For copyright notice see file Copyright         |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       edgeScalarField;
    object      contactAngle;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    left
    {
        type            calculated;
        value           uniform -70;
    }
    right
    {
        type            calculated;
        value           uniform -70;
    }
    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
