tutorials/surfaceTracking/newInterFreeFoam/capillarity2DoneFluid/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  | For copyright notice see file Copyright         |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    ddt(rho,U) backward;
    ddt(U) backward;
}

gradSchemes
{
    default Gauss linear;
}

divSchemes
{
    defalut none;
    div(phi,U) Gauss linear;
}

laplacianSchemes
{
    default none;
    laplacian(mu,U) Gauss linear corrected;
    laplacian((1|A(U)),p) Gauss linear corrected;

    laplacian((1|interpolate(A(U))),p) Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
}

// ************************************************************************* //
